#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>

#define SIZE 10000

int i = 0;
int clothes;
int vehicle;
int likeability = 0;
const char * heroine;
char maincharacter;

void Load(const char* fileName)
{
	FILE* file = fopen(fileName, "r");

	char buffer[SIZE] = { 0, };

	// 첫 번째 매개변수 : 읽은 데이터를 저장할 메모리 버퍼의 포인터 변수
	// 두 번째 매개변수 : 각 데이터 항목의 크기
	// 세 번째 매개변수 : 데이터를 읽어올 데이터 항목의 수
	// 네 번째 매개변수 : 데이터를 읽어올 파일의 포인터 변수

	fread(buffer, 1, SIZE, file);

	printf("%s", buffer);

	fclose(file);
}


void Clothes()
{
	Load("clothes1.txt");

	printf("\n");
	printf("  --------------------------------------------------------------------\n");
	printf(" | 오늘은 친구가 주선해준 소개팅에 가는 날이다. 무엇을 입고 가야할까? |\n");
	printf(" |                                                                    |\n");
	printf(" | 1. 정장 2. 츄리닝 3. 캐주얼                                        |\n");
	printf("  --------------------------------------------------------------------\n");
	printf("  ☞ 당신의 선택은? ");
	scanf_s("%d", &clothes);
	system("cls");

	switch (clothes)
	{
	case 1:
		Load("정장.txt");
		printf("  --------------------------------------------------------------------\n");
		printf(" | 정장 멋드러지게 차려입고 나가야지~!                                |\n");
		printf(" |                                                                    |\n");
		likeability = likeability++;
		printf(" | 호감도 + 1                                                         |\n");
		printf("  --------------------------------------------------------------------\n");
		break;
	case 2:
		Load("아디다스.txt");
		printf("  --------------------------------------------------------------------\n");
		printf(" | 역시 편한 게 최고지!! 아디다스 트레이닝복 너로 정했다!             |\n");
		printf(" |                                                                    |\n");
		likeability = likeability - 3;
		printf(" | 호감도 - 3                                                         |\n");
		printf("  --------------------------------------------------------------------\n");
		break;
	case 3:
		Load("캐주얼.txt");
		printf("  ------------------------------------------------------------------------\n");
		printf(" | 소개팅룩의 정석은 캐주얼룩이지! 브라운니트에다가 흰 팬츠로 맞춰야겠다! |\n");
		printf(" |                                                                        |\n");
		likeability = likeability + 3;
		printf(" | 호감도 + 3                                                             |\n");
		printf("  ------------------------------------------------------------------------\n");
		break;
	default:
		Load("경고.txt");
		printf("  --------------------------------------------------------------------\n");
		printf(" | 발가 벗고 나갔다!!                                                 |\n");
		printf(" |                                                                    |\n");
		likeability = likeability - 10;
		printf(" | 호감도 - 10                                                        |\n");
		printf("  --------------------------------------------------------------------\n");
		break;
	}
}

void Vehicle()
{
	printf("  --------------------------------------------------------------------\n");
	printf(" | 준비하다 보니 시간이 지체됐다! 무엇을 타고 가야 할까?              |\n");
	printf(" |                                                                    |\n");
	printf(" | 1. 택시 2. 지하철 3. 보도                                        |\n");
	printf("  --------------------------------------------------------------------\n");
	printf("  ☞ 당신의 선택은? ");
	scanf_s("%d", &vehicle);
	system("cls");
	switch (vehicle)
	{
	case 1:
		printf("  --------------------------------------------------------------------\n");
		printf(" | 택시!! 택시!! 다행히 잡을 수 있었다..! 제 시간에 도착할 것 같아!                               |\n");
		printf(" |                                                                    |\n");
		likeability = likeability + 3;
		printf(" | 호감도 + 3                                                         |\n");
		printf("  --------------------------------------------------------------------\n");
		break;
	case 2:
		printf("  --------------------------------------------------------------------\n");
		printf(" | 지하철도 충분히 빠르니깐!! 하지만 5분을 늦어버렸어...             |\n");
		printf(" |                                                                    |\n");
		likeability = likeability - 1;
		printf(" | 호감도 - 1                                                         |\n");
		printf("  --------------------------------------------------------------------\n");
		break;
	case 3:
		printf("  ------------------------------------------------------------------------\n");
		printf(" | 내 걸음은 충분히 빠르지 못해~! 15분이나 늦어버렸어.. |\n");
		printf(" |                                                                        |\n");
		likeability = likeability - 3;
		printf(" | 호감도 - 3                                                             |\n");
		printf("  ------------------------------------------------------------------------\n");
		break;
	default:
		printf("  --------------------------------------------------------------------\n");
		printf(" | 거북이를 타고 도착했어! 하지만 1시간이나 늦었는걸..!                                       |\n");
		printf(" |                                                                    |\n");
		likeability = likeability - 10;
		printf(" | 호감도 - 10                                                        |\n");
		printf("  --------------------------------------------------------------------\n");
		break;
	}
}

int main()
{

	const char* dialog[SIZE];

	dialog[0] = "저.. 혹시";
		printf("%s", heroine);
		"님이신가요?";
	dialog[1] = "어! 네네! &&님이시죠?";
	dialog[2] = "네! 아 먼저 자리에 앉아도 될까요?";
	dialog[3] = "네네 편하게 앉으세요!";
	dialog[4] = "으악! &&씨 발에 바퀴벌레 있어요!";
	dialog[5] = "";
	dialog[6] = "";
	dialog[7] = "";
	dialog[8] = "";
	dialog[9] = "";

	// 탐정 [5] 대사
	// 의뢰인 [5] 대사

	// 스페이스 -> 의뢰인 대사
	printf("당신의 이름은? ");
	scanf_s("%s", &maincharacter);

	printf("소개팅녀의 이름은? ");
	scanf_s("%s", &heroine);


	while (i < SIZE)
	{
		system("mode con: cols=100 lines=50");
		if (GetAsyncKeyState(VK_SPACE) & 0x0001)
		{
			system("cls");
			if (i == 0)
			{
				Clothes();
			}
			if (i == 1)
			{
				Vehicle();
			}
			if (i == 2)
			{
				printf("  --------------------------------------------------------------------\n");
				printf(" | 만나기로 한 카페에 들어가보니 한 여성분이 기다리고 계신다. 말을 걸어봐야겠다!              |\n");
				printf("  --------------------------------------------------------------------\n");
			}
			if (i == 7)
			{
				printf("  --------------------------------------------------------------------\n");
				printf(" | 어제 읽었던 소개팅의 정석 책 덕분에 그런지 순조롭게 대화를 잘 이어갈 수 있었다.             |\n");
				printf("  --------------------------------------------------------------------\n");
				printf("  --------------------------------------------------------------------\n");
				printf(" | 하지만 예상치 못한 상황에 난 굳어버렸다..             |\n");
				printf("  --------------------------------------------------------------------\n");
			}
			if (i % 2 == 1)
			{
				printf("나 : %s\n", dialog[i]);
			}
			else if (i % 2 == 0)
			{
				printf("소개팅녀 : %s\n", dialog[i]);
			}

			i++;
		}

	}
	return 0;
}